---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.LipLength
source: html/d50550dc-77b6-a269-49fe-e59d60a3c152.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```